# FluidTemperature Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystemType..::..FluidTemperature Property
PipingSystemType Class See Also
---
Fluid Temperature, in Kelvin.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double FluidTemperature { get; set; }
```

Visual Basic
---
```text
Public Property FluidTemperature As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double FluidTemperature {
	double get ();
	void set (double value);
}
```

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace